{"translation-revision-date":"2025-05-03 10:57:15+0000","generator":"GlotPress\/4.0.1","domain":"messages","locale_data":{"messages":{"":{"domain":"messages","plural-forms":"nplurals=3; plural=(n % 10 == 1 && n % 100 != 11) ? 0 : ((n % 10 >= 2 && n % 10 <= 4 && (n % 100 < 12 || n % 100 > 14)) ? 1 : 2);","lang":"ru"},"Forms":["Формы"],"Settings":["Настройки"],"Settings saved successfully":["Настройки успешно сохранены"],"Cancel":["Отмена"],"Appearance":["Внешний вид"],"Save":["Сохранить"],"General":["Основное"],"Filter Keys":["Ключи фильтра"],"Always show":["Отображать всегда"],"Here you can edit the filter keys globally and change the order of those in the URL.":["Здесь вы можете отредактировать ключи фильтра глобально и изменить их порядок в URL."],"Upgrade":["Обновить"],"Upgrade to Pro":["Обновиться до Pro"],"AND":["И"],"OR":["ИЛИ"],"Star Icon Color":["Цвет звёзд рейтинга"],"Primary Text Color":["Основной цвет текста"],"Primary Color":["Основной цвет"],"Need Help Getting Started?":["Только начали работать и нужна помочь?"],"Explore the comprehensive documentation and interactive demos.":["Изучите подробную документацию и интерактивные демонстрации."],"Documentation":["Документация"],"View Demos":["Демонстрации"],"Support & Questions":["Поддержка & Вопросы"],"Whether you need technical support, have questions about specific features, or need assistance with custom development, I'm here to help.":["Если вам нужна техническая поддержка, есть вопросы по конкретным функциям или требуется помощь в разработке на заказ, – я готов помочь."],"WP Support Forum":["Форум поддержки WP"],"Contact me":["Связаться со мной"],"Like the Plugin?":["Нравится этот плагин?"],"Your feedback is incredibly valuable to me. If you enjoy using my plugin, I kindly ask for your support by leaving a review.":["Ваш отзыв невероятно ценен для меня. Если вам нравится использовать мой плагин, поддержите меня, оставив отзыв."],"Write a review":["Написать отзыв"],"Version":["Версия"],"You are on the":["Вы на:"],"Free Plan":["Бесплатный тариф"],"Filter Relationships":["Отношения фильтров"],"The relationship between filters. AND - products shown will match all filters, OR - products shown will match any filters.":["Отношения между фильтрами. И - показанные товары будут соответствовать всем фильтрам, ИЛИ - показанные товары будут соответствовать любым подходящим фильтрам."],"Whether to update the product count number according to the applied filters.":["Обновлять ли количество товаров в соответствии с примененными фильтрами."],"Dynamic Product Count":["Динамическое количество товаров"],"Choose \"Always show\" to gray out filter options or \"Never show\" to hide filter options that have no associated products.":["Выберите «Всегда отображать», чтобы сделать параметры фильтра серыми, или «Никогда не отображать», чтобы скрыть параметры фильтра, не имеющие связанных с ними товаров."],"Options with zero products":["Параметры фильтра без товаров"],"Hide empty filters":["Скрыть пустые фильтры"],"Enable this if you want to disable filtering via Ajax.":["Активируйте опцию, если хотите отключить фильтрацию с помощью Ajax."],"Disable Ajax":["Отключить Ajax"],"Integration":["Интеграция"],"Loader & Scroll To":["Загрузка & Прокрутка"],"Others":["Другое"],"Miscellaneous":["Прочее"],"Enable this to show the active filters on top of the products loop, only works in the standard shop loop.":["Отображать ли активные фильтры поверх цикла товаров. Работает только в стандартном цикле магазина."],"Active Filters on top of products":["Активные фильтры над товарами"],"Pagination via Ajax":["Постраничная навигация с помощью Ajax"],"Whether to enable Ajax to paginate the products. Only applicable when filtering via Ajax.":["Использовать ли Ajax для постраничной навигации по товарам. Применяется только при фильтрации с помощью Ajax."],"Whether to enable Ajax for the default product sorting dropdown. Only applicable when filtering via Ajax.":["Использовать ли Ajax для стандартного раскрывающегося списка сортировки товаров. Применимо только при фильтрации с помощью Ajax."],"Product sorting via Ajax":["Сортировка товаров с помощью Ajax"],"Input Delay":["Задержка ввода"],"Wait Cursor":["Курсор ожидания"],"Paginate":["Пагинация"],"Filter":["Фильтр"],"All":["Все"],"Sorting data in Active Filters":["Порядок сортировки в активных фильтрах"],"Enable this if you want to show the sort-by data that comes from the default product sorting dropdown in active filters.":["Если включено, то выбранный порядок сортировки товаров, который задаётся через стандартный раскрывающийся список, будет отображаться среди активных фильтров."],"Use term slug":["Использовать ярлык термина"],"Whether to use term slug instead of id as the option value.":["Следует ли использовать в качестве значения параметра ярлык термина вместо его идентификатора."],"Child terms only":["Только дочерние термины"],"Whether to show only the child terms when viewing a term archive page.":["Показывать ли только дочерние термины при просмотре страницы архива терминов."],"Vendor support":["Поддержка продавцов"],"Enable this to show the store name as the option label in the post-author filter.":["Включите, чтобы название магазина отображалось в виде метки параметра в фильтре по автору публикации."],"Set a primary color according to your theme. Default is #1C5DA1.":["Установите основной цвет в соответствии с вашей темой. По умолчанию #1C5DA1."],"This color will be used over the primary color for the font color.":["Этот цвет будет использоваться вместо основного цвета шрифта."],"Enable this if you want stylish checkbox and radio buttons instead of native design.":["Включите, если вам нужен стильный дизайн флажков и переключателей вместо стандартного."],"Stylish checkbox & radio buttons":["Стильные флажки и переключатели"],"Enable ComboBox":["Включить ComboBox"],"Turns the native select element into a custom select box with improved design and behavior.":["Превращает обычное поле с выпадающим списком в пользовательское с улучшенным дизайном и поведением."],"Improve native select element":["Улучшить нативный выпадающий список"],"Uncheck this if your theme already implements the design for the native select element.":["Снимите флажок, если в вашей теме уже реализовано оформление выпадающего списка."],"Enable this to improve the scrollbar that appears when max height is applied to a filter.":["Включите, чтобы улучшить полосу прокрутки, которая появляется, когда область фильтров начинает переполняться."],"Improve scrollbar":["Улучшить полосу прокрутки"],"Improve input type text\/number":["Улучшить текстовые\/числовые поля"],"Enable this if you want to use styles from your theme for input type text\/number.":["Включите, если хотите использовать стили вашей темы для полей ввода текста\/чисел."],"Style %d":["Стиль %d"],"Set the star icon color for the rating filter(not applicable for display type: select, multiselect). Default is #FDA256.":["Установите цвет звезд для фильтра рейтинга (не применимо для типов отображения: выпадающий список, множественный выбор через выпадающий список). По умолчанию #FDA256."],"Enable this if your site loads the FontAwesome icons.":["Включите, если ваш сайт использует значки FontAwesome."],"FontAwesome for star icons":["FontAwesome для значков звездочек"],"Enable this to remove the focus style from input(text) and dropdown elements.":["Включите, чтобы удалить добавляемый плагином стиль фокусировки с текстовых полей ввода и выпадающих списков."],"Remove focus style":["Удалить стиль фокусировки"],"There are settings available only in the Pro version.":["Есть настройки, доступные только в Pro-версии."],"Loading Animation":["Анимация загрузки"],"Whether to show an animation while the results are fetching.":["Показывать ли анимацию при загрузке результатов."],"Overlay only":["Только наложение"],"Overlay + Loading Icon":["Наложение + значок загрузки"],"Loading Icon":["Значок загрузки"],"Select the loading icon from the available icons.":["Выберите значок загрузки из доступных вариантов."],"Icon Size":["Размер значка"],"Adjust the loading icon size in px. Default is 60.":["Настройте размер значка загрузки в пикселях. По умолчанию 60."],"Enable this to show a wait cursor while the results are fetching.":["Включите, чтобы отображать курсор ожидания во время загрузки результатов."],"Scroll window to":["Прокрутить окно до"],"Determines the scroll behavior.":["Настройки поведения прокрутки."],"Custom element":["Произвольный элемент"],"Custom element identifier":["Идентификатор произвольного элемента"],"Results container":["Контейнер с результатами"],"None":["Не задано"],"Desktop only":["Только на компьютерах"],"Mobile only":["Только на мобильных устройствах"],"Desktop and mobile":["На компьютерах и мобильных устройствах"],"After updating the results":["После обновления результатов"],"Immediately":["Сразу же"],"Scroll to top offset":["Прокрутить с учётом смещения сверху"],"If you have a sticky header or some space that you want to include in the viewport then give the height of those in px.":["Если у вас есть липкий заголовок или какое-то пространство, которое вы хотите включить в область просмотра, укажите их высоту в пикселях."],"Give a valid id\/class of the HTML element you want to scroll to.":["Укажите существующий идентификатор\/класс HTML-элемента, до которого вы хотите прокрутить."],"Global filter keys and order":["Глобальные ключи фильтров и их порядок"],"This will help you to configure the plugin correctly.":["Он поможет вам правильно настроить плагин."],"Debug Mode":["Режим отладки"],"Check this to disable WCAPF - WooCommerce Ajax Product Filter in the front end for testing purposes.":["Установите флажок, чтобы отключить WCAPF - WooCommerce Ajax Product Filter во внешнем интерфейсе в целях тестирования."],"Disable WCAPF":["Отключить WCAPF"],"Enable this if you agree to send anonymous data to the developer to make the plugin better.":["Включите, если вы согласны отправлять анонимные данные разработчику, чтобы улучшать плагин."],"Send anonymous data":["Отправлять анонимные данные"],"Remove Data":["Удалить данные"],"Enable this option to remove all data associated with WCAPF - WooCommerce Ajax Product Filter when you delete the plugin via the <b>Plugins<\/b> page.":["Включите, если хотите, чтобы при удалении плагина через страницу <b>Плагины<\/b> также удалились и все данные, связанные с WCAPF - WooCommerce Ajax Product Filter."],"Here you can change the phrases shown in the front end. Leave empty to use the default.":["Здесь вы можете изменить фразы, отображающиеся во внешнем интерфейсе. Оставьте поле пустым, чтобы использовать значение по умолчанию."],"Phrases":["Фразы"],"Keyword filter placeholder":["Подсказка в поле фильтра по ключевым словам"],"Search field placeholder":["Подсказка в поле поиска"],"Keyword filter prefix":["Префикс фильтра по ключевым словам"],"No results text":["Текст отсутствия результата"],"Empty filter text":["Текст пустого фильтра"],"Clear All button label":["Надпись кнопки «Очистить всё»"],"Reset button label":["Надпись кнопки «Сбрасить»"],"Show less button label":["Надпись кнопки «+ Развернуть»"],"Show more button label":["Надпись кнопки «- Свернуть»"],"Specify the delay (in milliseconds) before triggering the filter action when the user interacts with the input fields. Default is 300.":["Укажите задержку (в миллисекундах) перед запуском фильтрации при взаимодействии пользователя с полями ввода. По умолчанию 300."],"Pagination container":["Контейнер постраничной навигации"],"The css class of the pagination element, supports multiple classes separated by commas. In most cases, you don't need to change this. Applicable when filtering via Ajax.":["CSS-класс элемента постраничной навигации. Поддерживается несколько классов, разделенных запятыми. В большинстве случаев вам не нужно это менять. Применимо при фильтрации с помощью Ajax."],"You may want to run javascript codes after updating the shop loop via Ajax. Leave it empty if you don't understand.":["Возможно, вы захотите запускать код JavaScript после обновления списка товаров магазина с помощью Ajax. Оставьте поле пустым, если не понимаете."],"JavaScript after Ajax update":["JavaScript после Ajax-обновления"],"Author Roles":["Роли автора"],"These settings are applicable when filtering via ajax.":["Эти настройки применимы при фильтрации с помощью ajax."],"Please create some filters first then come back here.":["Пожалуйста, сначала создайте несколько фильтров, а затем вернитесь сюда."],"Changing the order of filter keys is a Pro feature.":["Изменение порядка ключей фильтра – это Pro-функция."],"Start typing to find the term":["Начните вводить, чтобы найти термин"],"No options text":["Текст при отсутствии параметров"],"Whether to hide the filters that don't have any options.":["Скрывать ли фильтры, у которых нет параметров."],"Please fix the errors below.":["Пожалуйста, исправьте ошибки ниже."],"Users having any of these roles will be available on the <b>Available Options<\/b> modal of the post-author filter.":["Пользователи с любой из этих ролей будут доступны в окне <b>Доступные параметры<\/b> в фильтре по автору постов."],"Sort by prefix":["Сортировать по префиксу"],"Components":["Компоненты"],"Select the number range slider style from the available ones.":["Выберите стиль слайдера диапазона чисел из доступных вариантов."],"Number range slider style":["Стиль слайдера диапазона"],"Uncheck this to show the hierarchy toggle just after the item label instead of at the end of the item.":["Снимите флажок, чтобы отобразить переключатель иерархии сразу после метки элемента, а не в конце элемента."],"Hierarchy toggle at the end":["Переключение иерархии в конце"],"Attach ComboBox for the default sorting dropdown instead of the native select element.":["Вместо нативного выпадающего списка сортировки по умолчанию использовать ComboBox."],"ComboBox for sorting dropdown":["ComboBox для выпадающего списка сортировки"],"Direct child only":["Только прямой ребенок"],"Loading...":["Загрузка ..."],"No terms found":["Термины не найдены."],"No authors found":["Авторы не найдены"],"Start typing to find the author":["Начните печатать, чтобы найти автора"],"Pro":["Pro"],"ID: %s":["ID: %s"],"Start typing to find the role":["Начните вводить текст, чтобы найти роль"],"No roles found":["Роли не найдены"],"Include children":["Включить дочерние"],"Filter key is in use by another entity.":["Ключ фильтра используется другим объектом."],"No option found":["Параметр не найден"],"Never show":["Никогда не отображать"]}},"comment":{"reference":"build\/settings.js"}}